tap "homebrew/services"
brew "php"
brew "composer"
brew "docker-compose"
brew "gh"
brew "git-filter-repo"
brew "git-lfs"
brew "mas"
brew "mise"
brew "mysql@8.4", restart_service: :changed
brew "prettier"
brew "rbenv"
brew "tree"
cask "adobe-acrobat-reader"
cask "arc"
cask "battery"
cask "cursor"
cask "discord"
cask "docker"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "hiddenbar"
cask "iterm2"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "ngrok"
cask "raycast"
cask "slack"
cask "timche-gmail-desktop"
cask "warp"
cask "zoom"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "shopify.ruby-lsp"
vscode "zhuangtongfa.material-theme"
