appulate.filewatcher
astro-build.astro-vscode
bierner.markdown-checkbox
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
brapifra.phpserver
charliermarsh.ruff
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
grapecity.gc-excelviewer
gruntfuggly.todo-tree
humao.rest-client
kaiwood.endwise
kevinrose.vsc-python-indent
leizongmin.node-module-intellisense
mechatroner.rainbow-csv
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-speech
ms-vsliveshare.vsliveshare
njpwerner.autodocstring
oracle.oracle-java
pixl-garden.bongocat
pkief.material-icon-theme
redhat.java
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
shopify.ruby-lsp
svelte.svelte-vscode
tomoki1207.pdf
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-initializr
wholroyd.jinja
zhuangtongfa.material-theme
